## Pandas

#### Pandas is a Python library.

#### Pandas is used to analyze data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

### Why Use Pandas?
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

### What Can Pandas Do?
#### Pandas gives you answers about the data. Like:

- Is there a correlation between two or more columns?
- What is average value?
- Max value?
- Min value?

### Where is the Pandas Codebase?
https://github.com/pandas-dev/pandas

In [10]:
pip install pandas

Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (2.2.2)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.26.0 in d:\anaconda\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\anaconda\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in d:\anaconda\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [12]:
import pandas

In [14]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

### Pandas as pd

In [1]:
import pandas as pd

In [50]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

### Pandas Version Checking

In [13]:
print(pd.__version__)

2.2.2

### What is a Series?

A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [36]:
a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

### Labels


If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.

In [39]:
print(myvar[0])

1

### Create Labels
With the 'index' argument, you can name your own labels.

In [3]:
import pandas as pd
a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [7]:
print(myvar["x"])

1

### Key/Value Objects as Series
You can also use a key/value object, like a dictionary, when creating a Series.

In [15]:
calories = {1: 420.2, 2: 380, 3: 390}

myvar = pd.Series(calories)

print(myvar)

1    420.2
2    380.0
3    390.0
dtype: float64

To select only some of the items in the dictionary, use the "index" argument and specify only the items you want to include in the Series.

In [25]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories, index = ["day1", "day2"])

print(myvar)

day1    420
day2    380
dtype: int64

### DataFrames
Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

In [15]:
data = {
  "calories": [420, 380, 390],
  "exercise_time": [50, 40, 45],
    "weight": [52,51,50]
}

myvar = pd.DataFrame(data)

print(myvar)

   calories  exercise_time  weight
0       420             50      52
1       380             40      51
2       390             45      50

In [17]:
type(myvar)

pandas.core.frame.DataFrame

In [29]:
import pandas as pd


data = {
  "calories": [420, 380, 390],
  "exercise_time": [50, 40, 45],
    "weight": [52,51,"a"]
}

df = pd.DataFrame(data)

print(df)

   calories  exercise_time weight
0       420             50     52
1       380             40     51
2       390             45      a

## New Lecture

### Locate Row

Pandas use the "loc" attribute to return one or more specified row(s)

In [23]:
print(df.iloc[0])

calories         420
exercise_time     50
weight            52
Name: 0, dtype: object

In [54]:
type(df.loc[0])

pandas.core.series.Series

Returns Series

If we Use Multi Brackets

In [21]:
print(df.loc[[0,1, 2]])

   calories  exercise_time weight
0       420             50     52
1       380             40     51
2       390             45      a

In [37]:
type(df.loc[[0,1]])

pandas.core.frame.DataFrame

Returns DataFrame

## Named Indexes
With the "index" argument, you can name your own indexes.

In [55]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["", "day2", "day3"])

print(df)

      calories  duration
           420        50
day2       380        40
day3       390        45

## Locate Named Indexes
Use the named index in the "loc" attribute to return the specified row(s).

In [47]:
print(df.loc["day2"])
# print(type(df.loc[["day2"]]))
# print(type(df.loc["day2"]))

calories    380
duration     40
Name: day2, dtype: int64

In [57]:
print(df.loc[["","day2", "day3"]])

      calories  duration
           420        50
day2       380        40
day3       390        45

Reading and Loading CSV files to a dataframe

In [65]:
path='C:/Users/Ali/Desktop/AI/Datasets/car_price_dataset.csv'
path2='C:/Users/Ali/Desktop/AI/Datasets/csvfile.txt'
df = pd.read_csv(path)
# df2= pd.read_csv(path2)
print(type(df))
print("________________________________________________________")
print(df)
# print(df2)

<class 'pandas.core.frame.DataFrame'>
________________________________________________________
           Brand     Model  Year  Engine_Size Fuel_Type    Transmission  \
0            Kia       Rio  2020          4.2    Diesel          Manual
1      Chevrolet    Malibu  2012          2.0    Hybrid       Automatic
2       Mercedes       GLA  2020          4.2    Diesel       Automatic
3           Audi        Q5  2023          2.0  Electric          Manual
4     Volkswagen      Golf  2003          2.6    Hybrid  Semi-Automatic
...          ...       ...   ...          ...       ...             ...
9995         Kia    Optima  2004          3.7    Diesel  Semi-Automatic
9996   Chevrolet    Impala  2002          1.4  Electric       Automatic
9997         BMW  3 Series  2010          3.0    Petrol       Automatic
9998        Ford  Explorer  2002          1.4    Hybrid       Automatic
9999  Volkswagen    Tiguan  2001          2.1    Diesel          Manual

      Mileage  Doors  Owner_Count  Price
0      289944      3            5   8501
1        5356      2            3  12092
2      231440      4            2  11171
3      160971      2            1  11780
4      286618      3            3   2867
...       ...    ...          ...    ...
9995     5794      2            4   8884
9996   168000      2            1   6240
9997    86664      5            1   9866
9998   225772      4            1   4084
9999   157882      3            3   3342

[10000 rows x 10 columns]

In [67]:
df

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867
...,...,...,...,...,...,...,...,...,...,...
9995,Kia,Optima,2004,3.7,Diesel,Semi-Automatic,5794,2,4,8884
9996,Chevrolet,Impala,2002,1.4,Electric,Automatic,168000,2,1,6240
9997,BMW,3 Series,2010,3.0,Petrol,Automatic,86664,5,1,9866
9998,Ford,Explorer,2002,1.4,Hybrid,Automatic,225772,4,1,4084
9999,Volkswagen,Tiguan,2001,2.1,Diesel,Manual,157882,3,3,3342

use "to_string()"" to print the Entire DataFrame.

In [71]:
print(df.head().to_string())

        Brand   Model  Year  Engine_Size Fuel_Type    Transmission  Mileage  Doors  Owner_Count  Price
0         Kia     Rio  2020          4.2    Diesel          Manual   289944      3            5   8501
1   Chevrolet  Malibu  2012          2.0    Hybrid       Automatic     5356      2            3  12092
2    Mercedes     GLA  2020          4.2    Diesel       Automatic   231440      4            2  11171
3        Audi      Q5  2023          2.0  Electric          Manual   160971      2            1  11780
4  Volkswagen    Golf  2003          2.6    Hybrid  Semi-Automatic   286618      3            3   2867

## printing Head

In [77]:
df.head(1)

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501

## printing Tail

In [83]:
df.tail(1)

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
9999,Volkswagen,Tiguan,2001,2.1,Diesel,Manual,157882,3,3,3342

## Checking Shape of Dataset

In [85]:
df.shape

(10000, 10)

## Max Rows when we simply display a Dataframe

In [87]:
print(pd.options.display.max_rows)

60

## Increase the maximum number of rows to display the entire DataFrame

In [91]:
pd.options.display.max_rows = 100000

df = pd.read_csv(path)

print(df.head())

        Brand   Model  Year  Engine_Size Fuel_Type    Transmission  Mileage  \
0         Kia     Rio  2020          4.2    Diesel          Manual   289944
1   Chevrolet  Malibu  2012          2.0    Hybrid       Automatic     5356
2    Mercedes     GLA  2020          4.2    Diesel       Automatic   231440
3        Audi      Q5  2023          2.0  Electric          Manual   160971
4  Volkswagen    Golf  2003          2.6    Hybrid  Semi-Automatic   286618

   Doors  Owner_Count  Price
0      3            5   8501
1      2            3  12092
2      4            2  11171
3      2            1  11780
4      3            3   2867

In [105]:
doors_column = df['Doors']
print(doors_column.head())

0    3
1    2
2    4
3    2
4    3
Name: Doors, dtype: int64

In [107]:
type(doors_column)

pandas.core.series.Series

## Accessing Multiple Rows or Columns

In [111]:
subset = df.loc[0:2, ['Brand', 'Model','Doors']]
print(subset)

       Brand   Model  Doors
0        Kia     Rio      3
1  Chevrolet  Malibu      2
2   Mercedes     GLA      4

##  Accessing Rows Based on Conditions

In [123]:
filtered_data = df[df['Year'] == 2010 ]
filter_2= df [df['Model']=='Civic']
print(filter_2.head().to_string())

    Brand  Model  Year  Engine_Size Fuel_Type    Transmission  Mileage  Doors  Owner_Count  Price
6   Honda  Civic  2010          3.4  Electric       Automatic   139584      3            1  11208
42  Honda  Civic  2000          3.9    Hybrid          Manual    56020      2            4   7879
53  Honda  Civic  2015          2.6  Electric  Semi-Automatic    66777      5            1  11864
59  Honda  Civic  2005          2.4    Petrol       Automatic    60316      2            5   8293
83  Honda  Civic  2020          4.6    Petrol          Manual   191397      3            4  10872

## Accessing Specific Cells with at and iat

In [127]:
model_at_index_2 = df.at[6, 'Model']
print(model_at_index_2)

Civic

In [1]:
import pandas as pd

## New Lecture

In [17]:
df = pd.DataFrame([['1993', 'Avi', 5, 41, 70, 'Bob'],  
                   ['1994', 'Cathy', 10, 1, 22, 'Cathy'],  
                   ['1995', 'Cathy', 24, 11, 44, 'Bob'],  
                   ['1996', 'Bob', 2, 11, 10, 'Avi'],  
                   ['1998', 'Avi', 20, 10, 40, 'Avi'], 
                   ['1999', 'Avi', 50, 8, 11, 'Cathy']], 
                  columns=('Patients', 'Name', 'Avi', 'Bob', 'Cathy', 'Aname')) 

df

  Patients   Name  Avi  Bob  Cathy  Aname
0     1993    Avi    5   41     70    Bob
1     1994  Cathy   10    1     22  Cathy
2     1995  Cathy   24   11     44    Bob
3     1996    Bob    2   11     10    Avi
4     1998    Avi   20   10     40    Avi
5     1999    Avi   50    8     11  Cathy

### Pandas Dataframe.pop()

In [19]:
poped_col=df.pop('Avi')

In [21]:
poped_col

0     5
1    10
2    24
3     2
4    20
5    50
Name: Avi, dtype: int64

## Drop()

In [23]:
df

  Patients   Name  Bob  Cathy  Aname
0     1993    Avi   41     70    Bob
1     1994  Cathy    1     22  Cathy
2     1995  Cathy   11     44    Bob
3     1996    Bob   11     10    Avi
4     1998    Avi   10     40    Avi
5     1999    Avi    8     11  Cathy

In [25]:
df=df.drop(columns=["Bob"])  # Removes column but doesn't return it
df

  Patients   Name  Cathy  Aname
0     1993    Avi     70    Bob
1     1994  Cathy     22  Cathy
2     1995  Cathy     44    Bob
3     1996    Bob     10    Avi
4     1998    Avi     40    Avi
5     1999    Avi     11  Cathy

## Get()

In [31]:
df.get("Name")

0      Avi
1    Cathy
2    Cathy
3      Bob
4      Avi
5      Avi
Name: Name, dtype: object

In [37]:
path='Datasets/car_price_dataset.csv'
data=pd.read_csv(path)
data.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867

In [45]:
x_train= data.get(['Brand','Model','Engine_Size'])
x_train.head()
y_train=data.get(['Price'])
# y_train.head()

In [33]:
d=df.get(["Patients", "Name","Cathy"])
d

  Patients   Name  Cathy
0     1993    Avi     70
1     1994  Cathy     22
2     1995  Cathy     44
3     1996    Bob     10
4     1998    Avi     40
5     1999    Avi     11

## Pandas DataFrame.isin()

In [47]:
df

  Patients   Name  Cathy  Aname
0     1993    Avi     70    Bob
1     1994  Cathy     22  Cathy
2     1995  Cathy     44    Bob
3     1996    Bob     10    Avi
4     1998    Avi     40    Avi
5     1999    Avi     11  Cathy

In [51]:
new = df["Name"].isin(["Avi"])
# print(new)
data1=df[new]
print(data1)

  Patients Name  Cathy  Aname
0     1993  Avi     70    Bob
4     1998  Avi     40    Avi
5     1999  Avi     11  Cathy

In [67]:
f1= df ["Name"].isin (["Avi", "Bob"])
f3= df ['Aname'].isin (["Cathy", "Bob"])
f2= df ["Patients"].isin (["1993", "1996"])
# f1 & f2
data=df[f1 & f2 | f3]
print(data)

  Patients   Name  Cathy  Aname
0     1993    Avi     70    Bob
1     1994  Cathy     22  Cathy
2     1995  Cathy     44    Bob
3     1996    Bob     10    Avi
5     1999    Avi     11  Cathy

## Pandas DataFrame.where()

In [122]:
import numpy as np

In [126]:
df = pd.DataFrame([['1999', 'Avi', 5, 41, 70, 'Bob'],  
                   [np.nan, 'Cathy', 10, 1, 22, 'Cathy'],  
                   ['1993', 'Cathy', 24, 11, 44, 'Bob'],  
                   ['1996', 'Bob', 2, 11, 10, 'Avi'],  
                   ['1992', 'Avi', 20, 10, 40, 'Avi'], 
                   ['1991', 'Avi', 50, 8, 11, 'Cathy']], 
                  columns=('Patients', 'Name', 'Avi', 'Bob', 'Cathy', 'Aname')) 

df

  Patients   Name  Avi  Bob  Cathy  Aname
0     1999    Avi    5   41     70    Bob
1      NaN  Cathy   10    1     22  Cathy
2     1993  Cathy   24   11     44    Bob
3     1996    Bob    2   11     10    Avi
4     1992    Avi   20   10     40    Avi
5     1991    Avi   50    8     11  Cathy

In [91]:
df.sort_values("Patients", inplace=True)

# Correct filtering
df1 = df[df["Patients"] == "1996"]  # This filters out rows where "Patients" is not 1993

df1

  Patients Name  Avi  Bob  Cathy Aname
3     1996  Bob    2   11     10   Avi

In [93]:
df

  Patients   Name  Avi  Bob  Cathy  Aname
5     1991    Avi   50    8     11  Cathy
4     1992    Avi   20   10     40    Avi
2     1993  Cathy   24   11     44    Bob
3     1996    Bob    2   11     10    Avi
1     1998  Cathy   10    1     22  Cathy
0     1999    Avi    5   41     70    Bob

In [97]:
df.describe()

             Avi        Bob      Cathy
count   6.000000   6.000000   6.000000
mean   18.500000  13.666667  32.833333
std    17.615334  13.909230  23.120698
min     2.000000   1.000000  10.000000
25%     6.250000   8.500000  13.750000
50%    15.000000  10.500000  31.000000
75%    23.000000  11.000000  43.000000
max    50.000000  41.000000  70.000000

## Null Check

In [128]:
ser= df.get("Patients")

In [130]:
pd.isna(ser)

0    False
1     True
2    False
3    False
4    False
5    False
Name: Patients, dtype: bool

In [132]:
path="Datasets/car_price_dataset.csv"
dataa=pd.read_csv(path)

In [136]:
dataa.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,NaN,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867

In [172]:
d1=dataa['Brand']

In [176]:
d1.isna()

0        True
1       False
2       False
3       False
4       False
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Name: Brand, Length: 10000, dtype: bool

## New Lecture

In [1]:
import pandas as pd

### Checking Columns

In [48]:
data = {'age': [21, 18, 27, 28],
        'name': ['Zain', 'Iftikhar', 'Saheem', 'Zafar'],
        'address': ['GB', 'ISB', 'KR','LHR']}
 
df = pd.DataFrame(data)
df

   age      name address
0   21      Zain      GB
1   18  Iftikhar     ISB
2   27    Saheem      KR
3   28     Zafar     LHR

In [9]:
df.columns

Index(['age', 'name', 'address'], dtype='object')

### Pandas dataframe.insert()

In [23]:
static_value = 'Male'
df['gender'] = static_value
print(df)
# o(n+1)

   age      name address gender
0   21      Zain      GB   Male
1   22  Iftikhar     ISB   Male
2   27    Saheem      KR   Male
3   28     Zafar     LHR   Male

In [50]:
new_columns_data = {'height': [160, 175, 168, 0], 
                    'weight': [55, 70, 65, 0]}  
 
new_columns_df = pd.DataFrame(new_columns_data)
df = pd.DataFrame(data)

In [52]:
result_df = pd.concat([df, new_columns_df], axis=1)
print(result_df)

   age      name address  height  weight
0   21      Zain      GB     160      55
1   18  Iftikhar     ISB     175      70
2   27    Saheem      KR     168      65
3   28     Zafar     LHR       0       0

In [27]:
result_df.columns

Index(['age', 'name', 'address', 'gender', 'height', 'weight'], dtype='object')

#### Insert Func

O(n)

In [54]:
new_columns_data = {'height': [170, 175, 180, 165],
                    'weight': [65, 70, 75, 60]}
new_columns_df = pd.DataFrame(new_columns_data)

df = pd.DataFrame(data)
 

df.insert(3, 'height', new_columns_df['height'])
df.insert(4, 'weight', pd.Series(new_columns_df['weight']))
 
print(df)

   age      name address  height  weight
0   21      Zain      GB     170      65
1   18  Iftikhar     ISB     175      70
2   27    Saheem      KR     180      75
3   28     Zafar     LHR     165      60

In [36]:
df['birth_year']=[1,2,3,4]

In [56]:
df

   age      name address  height  weight
0   21      Zain      GB     170      65
1   18  Iftikhar     ISB     175      70
2   27    Saheem      KR     180      75
3   28     Zafar     LHR     165      60

In [58]:
if 'birth_year' in df.columns:
    df.drop(columns=['birth_year'], inplace=True)
df.insert(1, 'birth_year', 2025 - df['age'])

In [60]:
df

   age  birth_year      name address  height  weight
0   21        2004      Zain      GB     170      65
1   18        2007  Iftikhar     ISB     175      70
2   27        1998    Saheem      KR     180      75
3   28        1997     Zafar     LHR     165      60

In [66]:
if 'status' in df.columns:
    df.drop(columns=['status'], inplace=True)
df.insert(3, 'status', ['Adult' if age > 18 else 'Minor' for age in df['age']])

print("\nDataFrame after inserting a column with conditional values:")
print(df)

DataFrame after inserting a column with conditional values:
   age  birth_year      name status address  height  weight
0   21        2004      Zain  Adult      GB     170      65
1   18        2007  Iftikhar  Minor     ISB     175      70
2   27        1998    Saheem  Adult      KR     180      75
3   28        1997     Zafar  Adult     LHR     165      60

In [68]:
import numpy as np

df.insert(2, 'random_value', np.random.rand(len(df)))

print("\nDataFrame after inserting a column with random values:")
print(df)

DataFrame after inserting a column with random values:
   age  birth_year  random_value      name status address  height  weight
0   21        2004      0.633980      Zain  Adult      GB     170      65
1   18        2007      0.144203  Iftikhar  Minor     ISB     175      70
2   27        1998      0.585928    Saheem  Adult      KR     180      75
3   28        1997      0.137980     Zafar  Adult     LHR     165      60

## Slicing Pandas Dataframe

##### Slicing a DataFrame in Pandas includes the following steps:

- Create a DataFrame
- Slice the DataFrame

In [70]:
import pandas as pd

player_list = [['Shahid Afridi', 36, 75, 5428000],
               ['A.B.D Villers', 38, 74, 3428000],
               ['V.Kohli', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000],
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])
df

            Name  Age  Weight   Salary
0  Shahid Afridi   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

#### 1. Slicing Using iloc
#### A. Slicing Rows in dataframe in python

In [72]:
df1 = df.iloc[0:4]


df1

            Name  Age  Weight   Salary
0  Shahid Afridi   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000

#### B. Slicing Columns in dataframe in python

In [78]:
df1 = df.iloc[:, 0:2]

df1

            Name  Age
0  Shahid Afridi   36
1  A.B.D Villers   38
2        V.Kohli   31
3        S.Smith   34
4        C.Gayle   40
5         J.Root   33
6     K.Peterson   42

#### C. Selecting a Specific Cell  in Dataframe in Python

In [84]:
df.head(1)

            Name  Age  Weight   Salary
0  Shahid Afridi   36      75  5428000

In [88]:
specific_cell_value = df.iloc[0, 0]  # Row 2, Column 3 (Salary)
print("Specific Cell Value:", specific_cell_value)

Specific Cell Value: Shahid Afridi

#### D. Using Boolean Conditions  in Dataframe in Python

In [110]:
filtered_data = df[df['Age'] < 35].iloc[:, :]  # Select rows where Age is greater than 35
print("\nFiltered Data based on Age > 35:\n", filtered_data)

Filtered Data based on Age > 35:
       Name  Age  Weight   Salary
2  V.Kohli   31      70  8428000
3  S.Smith   34      80  4428000
5   J.Root   33      72  7028000

#### 2. Slicing Using loc[]

In [98]:
df

            Name  Age  Weight   Salary
0  Shahid Afridi   36      75  5428000
1  A.B.D Villers   38      74  3428000
2        V.Kohli   31      70  8428000
3        S.Smith   34      80  4428000
4        C.Gayle   40     100  4528000
5         J.Root   33      72  7028000
6     K.Peterson   42      85  2528000

In [100]:
df_custom = df.set_index('Name')
df_custom

               Age  Weight   Salary
Name
Shahid Afridi   36      75  5428000
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000
C.Gayle         40     100  4528000
J.Root          33      72  7028000
K.Peterson      42      85  2528000

#### A. Slicing Rows in Dataframe in Python

In [102]:
sliced_rows_custom = df_custom.loc['A.B.D Villers':'S.Smith']
sliced_rows_custom

               Age  Weight   Salary
Name
A.B.D Villers   38      74  3428000
V.Kohli         31      70  8428000
S.Smith         34      80  4428000

#### B. Selecting Specified cell in Dataframe in Python

In [112]:
specific_cell_value = df_custom.loc['Shahid Afridi', 'Salary']
print("\nValue of the Specific Cell (Shahid Afridi, Salary):", specific_cell_value)

Value of the Specific Cell (Shahid Afridi, Salary): 5428000

## New Lecture

In [19]:
import pandas as pd

dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 818000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'Designer', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})
print(dataFrame)
display(dataFrame)

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37  818000     Designer
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35   93000         CHEF
2    PHOEBE     37  818000     Designer
3    ROSS       33  120000  PALENTOLOGY
4    CHANDLER   34   94000           IT
5    JOEY       30   95000       ARTIST

#### Filter Pandas Dataframe with multiple conditions

#### Filter Pandas Dataframe with multiple conditions Using loc

In [21]:
display(dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')),
                    ['Name','JOB','Salary']])

        Name       JOB  Salary
0   RACHEL    DESIGNER  100000
2   PHOEBE    Designer  818000

#### Filter Pandas Dataframe Using NumPy

In [25]:
import pandas as pd
import numpy as np

dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 40],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 950000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

                                 
filtered_values = np.where((dataFrame['Salary']>=100000) & (dataFrame['Age']==40) & (dataFrame['JOB'].str.startswith('A')))
print(filtered_values)
display(dataFrame.loc[filtered_values])

(array([5], dtype=int64),)

        Name  Age  Salary     JOB
5   JOEY       40  950000  ARTIST

#### Filter Pandas Dataframe Using Query (eval and query works only with columns)

In [39]:
import pandas as pd

dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 913000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

display(dataFrame.query('Salary  >= 100000 & (Age < 40 | JOB.str.startswith("C").values)'))

         Name  Age  Salary          JOB
0    RACHEL     30  100000     DESIGNER
1    MONICA     35  913000         CHEF
3    ROSS       33  120000  PALENTOLOGY

#### Pandas Boolean indexing multiple conditions standard way (â€œBoolean indexingâ€ works with values in a column only)

In [41]:
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                          
                          'Age': [30, 35, 37, 33, 34, 30],
                          
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                          
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})

display(dataFrame[(dataFrame['Salary']>=100000) & (dataFrame['Age']<40) | dataFrame['JOB'].str.startswith('P')][['Name','Age','Salary']])

         Name  Age  Salary
0    RACHEL     30  100000
3    ROSS       33  120000

#### Pandas Merging, Joining, and Concatenating

In [47]:
data1 = {'Name': ['Zaid', 'Junaid', 'Saqeeb', 'Azan'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

data2 = {'Name': ['Abdullah', 'Aqsan', 'Dayan', 'Sayam'],
         'Age': [17, 14, 12, 52],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])

display(df, df1)

     Name  Age    Address Qualification
0    Zaid   27     Nagpur           Msc
1  Junaid   24     Kanpur            MA
2  Saqeeb   22  Allahabad           MCA
3    Azan   32    Kannuaj           Phd

       Name  Age    Address Qualification
4  Abdullah   17     Nagpur         Btech
5     Aqsan   14     Kanpur           B.A
6     Dayan   12  Allahabad          Bcom
7     Sayam   52    Kannuaj        B.hons

In [51]:
frames = [df, df1]
print(type(frames))
res1 = pd.concat(frames)
res1

<class 'list'>

       Name  Age    Address Qualification
0      Zaid   27     Nagpur           Msc
1    Junaid   24     Kanpur            MA
2    Saqeeb   22  Allahabad           MCA
3      Azan   32    Kannuaj           Phd
4  Abdullah   17     Nagpur         Btech
5     Aqsan   14     Kanpur           B.A
6     Dayan   12  Allahabad          Bcom
7     Sayam   52    Kannuaj        B.hons

In [27]:
df = pd.DataFrame(data1, index=[0, 1, 2, 3])


df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification
0    Zaid   27     Nagpur           Msc
1  Junaid   24     Kanpur            MA
2  Saqeeb   22  Allahabad           MCA
3    Azan   32    Kannuaj           Phd

        Name  Age    Address Qualification
2  Abdullah   17     Nagpur         Btech
3     Aqsan   14     Kanpur           B.A
6     Dayan   12  Allahabad          Bcom
7     Sayam   52    Kannuaj        B.hons

#### Concatenating DataFrame by setting logic on axes :

In [53]:
data1 = {'Name': ['Zafar', 'Moiz', 'Zaman', 'Salman'],
         'Age': [27, 24, 22, 32],
         'Address': ['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
         'Qualification': ['Msc', 'MA', 'MCA', 'Phd'],
         'Mobile No': [97, 91, 58, 76]}

data2 = {'Name': ['Zaman', 'Salman', 'Zakir', 'Zain'],
         'Age': [22, 32, 12, 52],
         'Address': ['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'],
         'Qualification': ['MCA', 'Phd', 'Bcom', 'B.hons'],
         'Salary': [1000, 2000, 3000, 4000]}

df = pd.DataFrame(data1, index=[0, 1, 2, 3])

df1 = pd.DataFrame(data2, index=[2, 3, 6, 7])

print(df, "\n\n", df1)

     Name  Age    Address Qualification  Mobile No
0   Zafar   27     Nagpur           Msc         97
1    Moiz   24     Kanpur            MA         91
2   Zaman   22  Allahabad           MCA         58
3  Salman   32    Kannuaj           Phd         76

      Name  Age    Address Qualification  Salary
2   Zaman   22  Allahabad           MCA    1000
3  Salman   32    Kannuaj           Phd    2000
6   Zakir   12  Allahabad          Bcom    3000
7    Zain   52    Kannuaj        B.hons    4000

In [30]:
res2 = pd.concat([df, df1], axis=1, join='inner')

res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
2,Zaman,22,Allahabad,MCA,58,Zaman,22,Allahabad,MCA,1000
3,Salman,32,Kannuaj,Phd,76,Salman,32,Kannuaj,Phd,2000

#### union of dataframe.

In [31]:
res2 = pd.concat([df, df1], axis=1, sort=False)

res2

,Name,Age,Address,Qualification,Mobile No,Name,Age,Address,Qualification,Salary
0,Zafar,27.0,Nagpur,Msc,97.0,NaN,NaN,NaN,NaN,NaN
1,Moiz,24.0,Kanpur,MA,91.0,NaN,NaN,NaN,NaN,NaN
2,Zaman,22.0,Allahabad,MCA,58.0,Zaman,22.0,Allahabad,MCA,1000.0
3,Salman,32.0,Kannuaj,Phd,76.0,Salman,32.0,Kannuaj,Phd,2000.0
6,NaN,NaN,NaN,NaN,NaN,Zakir,12.0,Allahabad,Bcom,3000.0
7,NaN,NaN,NaN,NaN,NaN,Zain,52.0,Kannuaj,B.hons,4000.0

##### Concatenating DataFrame by ignoring indexes :

In [34]:
res = pd.concat([df, df1], ignore_index=True)
 
res

     Name  Age    Address Qualification  Mobile No  Salary
0   Zafar   27     Nagpur           Msc       97.0     NaN
1    Moiz   24     Kanpur            MA       91.0     NaN
2   Zaman   22  Allahabad           MCA       58.0     NaN
3  Salman   32    Kannuaj           Phd       76.0     NaN
4   Zaman   22  Allahabad           MCA        NaN  1000.0
5  Salman   32    Kannuaj           Phd        NaN  2000.0
6   Zakir   12  Allahabad          Bcom        NaN  3000.0
7    Zain   52    Kannuaj        B.hons        NaN  4000.0

##### Concatenating DataFrame with group keys :

In [57]:
frames = [df, df1 ]
 
res = pd.concat(frames, keys=['1st time collected data', '2nd time collected data'])
res

                             Name  Age    Address Qualification  Mobile No  \
1st time collected data 0   Zafar   27     Nagpur           Msc       97.0
                        1    Moiz   24     Kanpur            MA       91.0
                        2   Zaman   22  Allahabad           MCA       58.0
                        3  Salman   32    Kannuaj           Phd       76.0
2nd time collected data 2   Zaman   22  Allahabad           MCA        NaN
                        3  Salman   32    Kannuaj           Phd        NaN
                        6   Zakir   12  Allahabad          Bcom        NaN
                        7    Zain   52    Kannuaj        B.hons        NaN

                           Salary
1st time collected data 0     NaN
                        1     NaN
                        2     NaN
                        3     NaN
2nd time collected data 2  1000.0
                        3  2000.0
                        6  3000.0
                        7  4000.0

In [63]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Ali', 'Zubair', 'Sahil', 'Suhaib'], 
        'Age':[27, 24, 22, 32],} 

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 

data3 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Mobile Number':['00000', '11111', '66666', '999999'], 
        'Status':['Active', 'Offline', 'Dropped', 'Geraduated']} 
df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2) 
df2=  pd.DataFrame(data3)
 
print(df, "\n\n", df1,"\n\n", df2)

  key    Name  Age
0  K0     Ali   27
1  K1  Zubair   24
2  K2   Sahil   22
3  K3  Suhaib   32

   key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

   key Mobile Number      Status
0  K0         00000      Active
1  K1         11111     Offline
2  K2         66666     Dropped
3  K3        999999  Geraduated

##### Merging a dataframe with one unique key combination

In [69]:
res = pd.merge(df, df1, on='key')
 
res2=pd.merge(res,df2, on='key')
res2

  key    Name  Age    Address Qualification Mobile Number      Status
0  K0     Ali   27     Nagpur         Btech         00000      Active
1  K1  Zubair   24     Kanpur           B.A         11111     Offline
2  K2   Sahil   22  Allahabad          Bcom         66666     Dropped
3  K3  Suhaib   32    Kannuaj        B.hons        999999  Geraduated

##### Sorting

##### 1. Sort DataFrame by One Column Value

In [71]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],'Age': [25, 30, 35, 40],'Score': [85, 90, 95, 80]}
df = pd.DataFrame(data)

sorted_df = df.sort_values(by='Age',ascending=True)
print(sorted_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

##### 2. Sort DataFrame by Multiple Columns

In [46]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Score': [85, 90, 95, 80]}
df = pd.DataFrame(data)

sorted_df = df.sort_values(by=['Age', 'Score'])
print(sorted_df)

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     95
3    David   40     80

##### 3. Sort DataFrame with Missing Values

In [75]:
data_with_nan = {"Name": ["Alice", "Bob", "Charlie", "David"],"Age": [28, None, None, 22]}
df_nan = pd.DataFrame(data_with_nan)

sorted_df = df_nan.sort_values(by="Age", na_position="first")
print(sorted_df)

      Name   Age
1      Bob   NaN
2  Charlie   NaN
3    David  22.0
0    Alice  28.0

#### How to Create a Pivot Table in Python using Pandas?

A pivot table is a statistical table that summarizes a substantial table like a big dataset. It is part of data processing. This summary in pivot tables may include mean, median, sum, or other statistical terms.

In [77]:
df = pd.DataFrame({'Product': ['Carrots', 'Broccoli', 'Banana', 'Banana',
                               'Beans', 'Orange', 'Broccoli', 'Banana'],
                   'Category': ['Vegetable', 'Vegetable', 'Fruit', 'Fruit',
                                'Vegetable', 'Fruit', 'Vegetable', 'Fruit'],
                   'Quantity': [8, 5, 3, 4, 5, 9, 11, 8],
                   'Amount': [270, 239, 617, 384, 626, 610, 62, 90]})
df

    Product   Category  Quantity  Amount
0   Carrots  Vegetable         8     270
1  Broccoli  Vegetable         5     239
2    Banana      Fruit         3     617
3    Banana      Fruit         4     384
4     Beans  Vegetable         5     626
5    Orange      Fruit         9     610
6  Broccoli  Vegetable        11      62
7    Banana      Fruit         8      90

In [81]:
pivot = df.pivot_table(index=['Product'],
					values=['Amount'],
					aggfunc='sum')
display(pivot)

          Amount
Product
Banana      1091
Beans        626
Broccoli     301
Carrots      270
Orange       610

In [83]:
pivot = df.pivot_table(index=['Category'],
                       values=['Amount'],
                       aggfunc='sum')
display(pivot)

           Amount
Category
Fruit        1701
Vegetable    1197

In [65]:




pivot = df.pivot_table(index=['Product', 'Category'],
                       values=['Amount'], aggfunc='sum')
display(pivot)

                    Amount
Product  Category
Banana   Fruit        1091
Beans    Vegetable     626
Broccoli Vegetable     301
Carrots  Vegetable     270
Orange   Fruit         610

In [72]:
pivot = df.pivot_table(index=['Category'], values=['Amount'],
                       aggfunc={'median', 'mean', 'min','sum'})
display(pivot)

           Amount
             mean median min   sum
Category
Fruit      425.25  497.0  90  1701
Vegetable  299.25  254.5  62  1197

In [85]:
pivot = df.pivot_table(index=['Product'], values=['Amount'],
                       aggfunc={'median', 'mean', 'min'})
display(pivot)

              Amount
                mean median  min
Product
Banana    363.666667  384.0   90
Beans     626.000000  626.0  626
Broccoli  150.500000  150.5   62
Carrots   270.000000  270.0  270
Orange    610.000000  610.0  610